mongoose  = require 'mongoose'
Promise   = require 'promise'
ObjectId  = mongoose.Schema.Types.ObjectId
tagger    = require '../../helpers/tagger'

config     = require '../../config'

сonnection = mongoose.createConnection "mongodb://localhost/#{config.database}"
require '../../models/lot'
Lot        = сonnection.model 'Lot'

module.exports = (grunt) ->
  grunt.registerTask 'migration:update-tags', ->
    try
      done = @async()
      perPage = 100
      proceed_range = (skip, cb) ->
        Lot.find().skip(skip).limit(100).exec (err, lots) ->
          cb(err) if err?
          if not lots? or lots.length is 0 then cb()
          console.log "Skip: #{skip}       Lots: #{lots.length}"
          lot_promises = []
          for lot in lots
            tagger lot, (err, nlot) ->
              cb(err) if err?
              lot_promises.push new Promise (resolve) -> nlot.save(resolve)
          Promise.all(lot_promises).catch(cb).then -> proceed_range(skip + perPage, cb)
      proceed_range 0, done
    catch e then done(e)

  grunt.registerTask 'migration:add-tags', ->
    done = @async()
    сonnection = mongoose.createConnection "mongodb://localhost/#{config.database}"
    сonnection.collection('tags').insert [
      {
        '_id': ObjectId('5551f96714fa751d83cb6559')
        'title': 'право аренды'
        'keywords': [ '(^| )право.{0,30} аренд' ]
        'color': '#7dbc35'
      }
      {
        '_id': ObjectId('5551f96714fa751d83cb655a')
        'title': 'пассажирский транспорт'
        'keywords': [
          '(^| )автобус'
          '(^| )минив(э|е)н'
          '(^| )микроавтобус'
          '(^| )пассажирск'
          {
            'word': '(^| )ЛИАЗ'
            'ignorecase': false
          }
          {
            'word': '(^| )ПАЗ'
            'ignorecase': false
          }
        ]
        'color': '#1d54a9'
      }
      {
        '_id': ObjectId('5551f96714fa751d83cb655b')
        'title': 'автомобильная техника'
        'keywords': [
          'прицеп'
          '(^| )цистерна'
          '(^| )купава'
          '(^| )оборудован.{0,25} для.{0,25} трактор'
          '(^| )оборудован.{0,25} для.{0,25} комбайн'
          '(^| )сеялка'
          '(^| )веялка'
          '(^| )культиватор'
        ]
        'color': '#54b9ff'
      }
      {
        '_id': ObjectId('5551f96714fa751d83cb655c')
        'title': 'грузовые автомобили'
        'keywords': [
          '(^| )грузово.{0,10}автомобиль'
          '(^| )тягач '
          '(^| )седельн'
          '(^| )фура'
          '(^| )кунг'
          '(^| )Камаз($| |.|,|:|-)'
          {
            'word': '(^| )КАМАЗ'
            'ignorecase': false
          }
          {
            'word': '(^| )МАЗ'
            'ignorecase': false
          }
          {
            'word': '(^| )MAN'
            'ignorecase': false
          }
          {
            'word': '(^| )МАН'
            'ignorecase': false
          }
          {
            'word': '(^| )ЗИЛ'
            'ignorecase': false
          }
          {
            'word': '(^| )ЗиЛ'
            'ignorecase': false
          }
          {
            'word': '(^| )УРАЛ'
            'ignorecase': false
          }
          {
            'word': '(^| )ГАЗ'
            'ignorecase': false
          }
        ]
        'color': '#3e89be'
      }
      {
        '_id': ObjectId('5551f96714fa751d83cb655d')
        'title': 'гаражи'
        'keywords': [
          '(^| )гараж'
          '(^| )гаражн'
          '(^| )машиномест'
        ]
        'color': '#a8c208'
      }
      {
        '_id': ObjectId('5551f96714fa751d83cb655e')
        'title': 'животные,скот'
        'keywords': [
          '(^| )КРС'
          '(^| )скот'
          '(^| )крупнорогат'
          '(^| )телка'
          '(^| )стельн'
          '(^| )ялова'
          '(^| )молодняк'
        ]
        'color': '#b68e52'
      }
      {
        '_id': ObjectId('5551f96714fa751d83cb655f')
        'title': 'жилая недвижимость'
        'keywords': [
          '(^| )квартир'
          '(^| )((?!торговый).{8}) дом($| )'
          '(^| )((?!банковский).{10}) дом($| )'
          '(^| )((?!аукционный).{10}) дом($| )'
          '(^| )((?!финансовый).{10}) дом($| )'
          '(^| )((?!страховой).{9}) дом($| )'
          '(^| )((?!не).{2}|^.{0,1})жил(ой|ая)'
          '(^| )лофт'
          '(^| )студи'
          '(^| )апартамент'
          '(^| )дачн'
          '((?!не).{2}|^.{0,1})жило.{0,25} здани'
          '((?!не).{2}|^.{0,1})жило.{0,25} строен'
          '(^| )домовладен'
        ]
        'color': '#78ad00'
      }
      {
        '_id': ObjectId('5551f96714fa751d83cb6560')
        'title': 'задолженность'
        'keywords': [
          { 'and': [
            '(^| )требовани(я|е)(?=([хми]*))\\3((?! к заявк).{8}|.{0,7}$)'
            '(^| )требовани(я|е)(?=([хми]*))\\3((?! к документ).{11}|.{0,10}$)'
            '(^| )требовани(я|е)(?=([хми]*))\\3((?! к допуск).{9}|.{0,8}$)'
          ] }
          '(^| )долг((?!осрочн).{6}|.{0,5}$)'
          '(^| )задолженность'
          '(^| )дебиторск'
        ]
        'alone': true
        'color': '#bd0820'
      }
      {
        '_id': ObjectId('5551f96714fa751d83cb6561')
        'title': 'залог,обременение'
        'keywords': [ { 'and': [
          '((?!не ).{3}|^.{0,2})залог'
          '((?!не явля[ею]тся предметом ).{22}|^.{0,21})залог'
          '((?!свободн(ая|ое|ые|ый) от ).{13}|^.{0,12})залог'
          '((?!не обремен[её]н ).{13}|^.{0,12})залог'
        ] } ]
        'color': '#e05100'
      }
      {
        '_id': ObjectId('5551f96714fa751d83cb6562')
        'title': 'земля,землеотвод'
        'keywords': [
          '(^| )земельн'
          '(^| )землеотвод'
          '(^| )кадастр'
          '(^| )участок'
        ]
        'color': '#3fb800'
      }
      {
        '_id': ObjectId('5551f96714fa751d83cb6563')
        'title': 'инфраструктура'
        'keywords': [
          '(^| )отопительн.{0,10}сет(ь|и)'
          '(^| )канализац.{0,10}сет(ь|и)'
          '(^| )водоснабжен.{0,10}сет(ь|и)'
          '(^| )сет(ь|и).{0,10}водоснабжен'
          '(^| )электропередач'
          '(^| )газоснабжен'
          '(^| )коллектор'
          '(^| )водопроводн'
          '(^| )электроснабжен'
          '(^| )теплопередач'
          '(^| )подстанц'
          '(^| )трансформаторная'
          '(^| )подъездн'
          '(^| )путепровод'
          '(^| )котельн'
          '(^| )водосброс'
          '(^| )дренаж'
          '(^| )плотин'
          '(^| )автодорог(а)'
          '(^| )кабельн.{0,20}эстакад(а|ы)'
          '(^| )автодорог(а|и)'
          {
            'word': '(^| )ЛЭП'
            'ignorecase': false
          }
        ]
        'color': '#2a943a'
      }
      {
        '_id': ObjectId('5551f96714fa751d83cb6564')
        'title': 'коммерческая недвижимость'
        'keywords': [
          '(^| )столова'
          '(^| )каф(е|э)'
          {
            'and': [
              '(^| )бар'
              '^((?! БАР[).,:]).{5}|^.{0,4})$'
            ]
            'ignorecase': false
          }
          '(^| )клуб($| )'
          '(^| )дискотек'
          '(^| )ресторан'
          '(^| )закусочн'
          '(^| )рюмочн'
          '(^| )шаурм'
          '(^| )шаверм'
          '(^| )шашлычна'
          '(^| )магазин'
          '(^| )супермаркет'
          '(^| )мини(-)?маркет'
          '(^| )магазин'
          '(^| )розничн.*точка'
          '(^| )оптово-розничн'
          '(^| )торгово-закупочн'
          '(^| )автостоянк'
          '(^| )парковк'
          '(^| )унив(и|е)рмаг'
          '(^| )гостиниц'
        ]
        'color': '#1b630c'
      }
      {
        '_id': ObjectId('5551f96714fa751d83cb6565')
        'title': 'компьютеры,оргтехника'
        'keywords': [
          '(^| )компьютер'
          '(^| )принтер'
          '(^| )сканер'
          '(^| )ксерокс'
          '(^| )копир'
          '(^| )мфу'
          '(^| )плот(т)?ер'
          '(^| )копир'
          '(^| )ноутбук'
          '(^| )планшет'
          '(^| )сервер'
          '(^| )image.{0,15}scan(n)?er'
        ]
        'color': '#5a2e58'
      }
      {
        '_id': ObjectId('5551f96714fa751d83cb6566')
        'title': 'легковые и коммерческие авто'
        'keywords': [
          '((?!грузовой).{8}|^.{0,7})(^| )авт(а|о)мобиль'
          '(^| )легк(а|о)вой авт(а|о)мобиль'
          '(^| )авт. '
          '(^| )пикап'
          '(^| )джип'
          '(^| )седан'
          '(^| )х(е|э)тчб(е|э)к'
          '(^| )пирожок'
          '(^| )Порше'
          '(^| )Porsche'
          '(^| )ВАЗ'
          '(^| )Газель'
          '(^| )Соболь'
          '(^| )Т(а|о)йота'
          '(^| )Toyota'
          '(^| )Hundai'
          '(^| )Х(ю|у)ндай'
          '(^| )Х(ё|е)нд(е|э)'
          '(^| )Mazda'
          '(^| )Мазда'
          '(^| )Фиат'
          '(^| )FIAT'
          '(^| )Nissan'
          '(^| )Нис(с)?ан'
          {
            'word': '(^| )ГАЗ.{0,10}2752'
            'ignorecase': false
          }
          {
            'word': '(^| )УАЗ'
            'ignorecase': false
          }
        ]
        'color': '#3466e1'
      }
      {
        '_id': ObjectId('5551f96714fa751d83cb6567')
        'title': 'машины и оборудование'
        'keywords': [
          '(^| )сборочн.* линия'
          '(^| )конвейер'
          '(^| )к(о|а)нвеер'
          '(^| )агрегат'
          '(^| )к(о|а)мпрес(с?)ор'
          '(^| )ст(е|э)нд($| )'
          '(^| )кран-балк'
          '(^| )таль($| )'
          '(^| )генераторн'
          '(^| )генератор($| )'
          '(^| )кран.{0,10}консольн'
          '(^| )сварочн'
        ]
        'color': '#e19500'
      }
      {
        '_id': ObjectId('5551f96714fa751d83cb6568')
        'title': 'мебель'
        'keywords': [
          '(^| )стол(ы)?($| )'
          '(^| )стул(ья)?($| )'
          '(^| )платяной.{0,10} шкаф'
          '(^| )стеллаж'
          '(^| )тумб'
          '(^| )кровать'
          '(^| )прикроватн'
          '(^| )д/одежды'
          '(^| )для одежды'
          '(^| )комод'
          '(^| )сервант'
          '(^| )директорск'
          '(^| )кресл(о|а)'
          '(^| )полка(и)?.{0,10}для'
          '(^| )набор.{0,10}мебели'
          '(^| )мебельн.{0,10}гарнитур'
        ]
        'color': '#b38000'
      }
      {
        '_id': ObjectId('5551f96714fa751d83cb6569')
        'title': 'офис'
        'keywords': [
          '(^| )контор'
          '(^| )оф(ф)?ис(?!сервис)'
          '(^| )административн'
          '(^| )здани.{0,10}правлени(е|я)($| )'
        ]
        'color': '#477d0e'
      }
      {
        '_id': ObjectId('5551f96714fa751d83cb656a')
        'title': 'производственные здания,сооружения'
        'keywords': [
          '(^| )цех($| |.|,)'
          '(^| )пристрой'
          '(^| )построй'
          '(^| )проходн'
          '(^| )корпус($| )'
          '(^| )промышлен'
          '(^| )депо'
          '(^| )фабрик'
          '(^| )инкубатор'
          '(^| )нежил.{0,10}здани'
          '(^| )коровник'
          '(^| )свиноферм'
          '(^| )птицеферм'
          '(^| )кузниц'
          '(^| )производствен.{0,10}строен'
          '(^| )мастерска'
          '(^| |-)здани.{0,25}нежило'
        ]
        'color': '#3e5a19'
      }
      {
        '_id': ObjectId('5551f96714fa751d83cb656b')
        'title': 'радиотехника'
        'keywords': [
          '(^| )аудио'
          '(^| )микшер'
          '(^| )усилитель'
          '(^| )студийн'
        ]
        'color': '#d8772c'
      }
      {
        '_id': ObjectId('5551f96714fa751d83cb656c')
        'title': 'склад'
        'keywords': [
          '(^| )склад'
          '(^| )логисти'
          '(^| )хранилищ'
          '(^| )кладов'
          '(^| )ангар($| )'
        ]
        'color': '#728416'
      }
      {
        '_id': ObjectId('5551f96714fa751d83cb656d')
        'title': 'специальная автотехника'
        'keywords': [
          '(^| )вездеход'
          '(^| )самосвал'
          '(^| )грейдер'
          '(^| )каток'
          '(^| )автокран'
          '(^| )траншее'
          '(^| )канаво'
          '(^| )укладчик'
          '(^| )погрузчик'
          '(^| )электрокар'
          '((?!оборудовани[ея] для ).{17}|^.{0,16})трактор'
          '(^| )бульдозер'
          '(^| )комбайн'
          '(^| )экск(а|о)ватор'
          '(^| )кормоуборочн'
          '(^| )топливозаправщик'
          '(^| )мусоровоз'
          '(^| )ассенизац.{0,15}машин'
          '(^| )машина.{0,15}коммунальная'
          '(^| )Komatsu'
          '(^| )Кома(т)?цу'
          '(^| )Беларус(ь)?'
          '(^| )Bobcat'
          '(^| )Бобк(а|э|е)т'
        ]
        'color': '#032cc7'
      }
      {
        '_id': ObjectId('5551f96714fa751d83cb656e')
        'title': 'средства связи'
        'keywords': [
          { 'and': [
            '((?!по).{2}|^.{0,1})(^| )телефон'
            '(^| )телефон((?! для справ).{10}|.{0,9}$)'
            '(^| )телефон((?! для предв).{10}|.{0,9}$)'
          ] }
          '(^| )спутник'
          '(^| )сотов'
          '(^| )рация'
          '(^| )передатчик'
          '(^| )антенн'
          {
            'word': '(^| )АТС'
            'ignorecase': false
          }
        ]
        'color': '#7e6200'
      }
      {
        '_id': ObjectId('5551f96714fa751d83cb656f')
        'title': 'станки'
        'keywords': [
          '(^| )стан(ки|ок)'
          '(^| )токарн'
          '(^| )расточн'
          '(^| )координатн'
          '(^| )фрезерн'
          '(^| )штамповочн'
          '(^| )кузнечн'
          '(^| )стан(о?)к(и?)'
          '(^| )обрабатывающ'
          '(^| )ЧПУ'
          '(^| )робото'
          '(^| )автомат($| )'
          '(^| )прессовочн'
          '(^| )формовочн'
          '(^| )штамп'
          '(^| )электромеханическ'
          '(^| )электрогидравлическ'
          '(^| )пневматическ'
          '(^| )пневмогидравлическ'
          '(^| )шлифовальн'
          '(^| )пресс'
        ]
        'color': '#825f3f'
      }
      {
        '_id': ObjectId('5551f96714fa751d83cb6570')
        'title': 'юридические сложности'
        'keywords': [
          '(?!госрегистрац.{0,30})(^| )собственник'
          '(^| )титул'
          '(?!свидетельств.{0,20})(^| )собственност'
          '(^| )документ.{0,10}отсутству(е|ю)т'
        ]
        'color': '#75221f'
      }
      {
        '_id': ObjectId('5551f98f8e34e02bb365d3de')
        'title': 'разное'
        'keywords': []
        'color': '#476d5e'
      }
    ], (err, result) ->
      сonnection.close()
      if err? then done(err) else done()